0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type codedFixedValue;
        value uniform (0 0 0);
        name inletLogProfile;

        code
        #{
            const fvPatch& boundaryPatch = patch();
            vectorField& field = *this;

            scalar uStar = 1.368;   // Friction velocity 
            scalar kappa = 0.41;    // von Karman constant
            scalar y0 = 0.1;        // Roughness length
            scalar d = 0.0;         // Zero-plane displacement, use 0.0 if flat-terrain

            const vectorField& Cf = boundaryPatch.Cf();

            forAll(field, faceI)
            {
                scalar y = Cf[faceI].y();
                scalar effectiveY = max(y - d, 0.01); // avoid log(0)

                scalar Uprofile = uStar / kappa * log(effectiveY / y0);

                field[faceI] = vector(Uprofile, 0, 0);
            }
        #};
    }



    outlet
    {
        type            zeroGradient;
    }


    frontAndBack
    {
        type            empty;
    }

    ".*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
