system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: Your version here                     |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

/* Parallel decomposition dictionary */

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 3;

// method scotch;

method simple;

simpleCoeffs
{
    n               (3 1 1);   // 2 splits in X (100m -> 50m), 2 splits in Y (30m -> 15m), 1 in Z
    delta           0.001;
}

distributed no;
